notebook.org
* 逻辑学介绍
** 事实错误与逻辑错误
   上帝在第三天创造了太阳。
   这里的“天”计量是从太阳光照得来的。
   那么三天前太阳是存在又不存在的。
   逻辑错误一定不是可辩解的。
** 例题
   1，2，3，4，5五个人，戴着白帽子黑帽子，白帽子只说真话，黑帽子只说假话。
   他们说的五句话。
   1说:我看见三顶白帽子一顶黑帽子;
   2说:我看见四顶黑帽子;
   4说:我看见一顶白帽子三顶黑帽子;
   5说:我看见四顶白帽子;
| 1 | 2  | 3 | 4 | 5  |
|---+----+---+---+----|
| S | -S |   |   | -S |
| X | S  |   |   |    |
| X | X  |   | S | X  |
| F | F  | T | T | F  |
** 三段论逻辑
   反例解释
   1.结构相同
   2.前提真而结果假
** 选择观察效应
* 引言:大师与智者
** 半费之讼
** 苏格拉底
** “逻辑学之父”:亚里士多德
** 公孙龙 
** 邓析
** 名学辩学大成:墨子
* 思维形态与语言单位
|      |                        |
|------+------------------------|
| 词项 | 词语名词性词组         |
| 命题 | 语句（因果性语句除外） |
| 推理 | 因果性语句，句组       |
** 思维形式
   同一类型得思维形态所共有 得具有得思维形式就称作该思维的逻辑形式，又称为形式结构，简称公式
   其中保持不变的是逻辑常量，变化的是逻辑变量。
*** 第一组 （命题）所有S是P
    - 所有商品都是有价值的。
    - 所有物质都是可分割的。
    - 所有发展都是由事物内部矛盾引起的。
*** 第二组 （命题）如果p,那么q
    - 如果为人民利益而死，就比泰山还重。
    - 如果一个人得了肺病，那么这个人就会发烧。
    - 如果出现了阶级，那么就会出现国家。
*** 第三组 （推理，因果关系）所有M都是P;所有S都是M
    - 所有学生都应该知书识礼。            所有M都是P
    - 所有大学生都是学生。                所有S都是M
    - ------------------------------- 
    - 所以，所以大学生都应该知书识礼。    所以，所有S都是P
** 常用逻辑符号
*** 逻辑常项
    定义：指的是一个逻辑形式中具有确切含义，其含义始终保持不变得部分
    如下：“ *如果*...... *那么* ......"
*** 逻辑变项
    定义：指一个逻辑形式中没有确切含义，可用不同词项或者命题进行替换的部分。
    如下：S,P等等。
*** 词项变项
    通常用 _大写字母_ ：S,P,M表示。
*** 命题变项
    一般使用 _小写字母_ 表示：p，q，r，s。
    
