notebook.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2019-09-06 周五 00:08 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title"></h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 逻辑学介绍</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 事实错误与逻辑错误</h3>
<div class="outline-text-3" id="text-1-1">
<p>
上帝在第三天创造了太阳。
这里的“天”计量是从太阳光照得来的。
那么三天前太阳是存在又不存在的。
逻辑错误一定不是可辩解的。
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 例题</h3>
<div class="outline-text-3" id="text-1-2">
<p>
1，2，3，4，5五个人，戴着白帽子黑帽子，白帽子只说真话，黑帽子只说假话。
他们说的五句话。
1说:我看见三顶白帽子一顶黑帽子;
2说:我看见四顶黑帽子;
4说:我看见一顶白帽子三顶黑帽子;
5说:我看见四顶白帽子;
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 三段论逻辑</h3>
<div class="outline-text-3" id="text-1-3">
<p>
反例解释
1.结构相同
2.前提真而结果假
</p>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 选择观察效应</h3>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 引言:大师与智者</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 半费之讼</h3>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 苏格拉底</h3>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> “逻辑学之父”:亚里士多德</h3>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 公孙龙</h3>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 邓析</h3>
</div>
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 名学辩学大成:墨子</h3>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 思维形态与语言单位</h2>
<div class="outline-text-2" id="text-3">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">&#xa0;</th>
<th scope="col" class="text-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">词项</td>
<td class="text-left">词语名词性词组</td>
</tr>

<tr>
<td class="text-left">命题</td>
<td class="text-left">语句（因果性语句除外）</td>
</tr>

<tr>
<td class="text-left">推理</td>
<td class="text-left">因果性语句，句组</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 思维形式</h3>
<div class="outline-text-3" id="text-3-1">
<p>
同一类型得思维形态所共有 得具有得思维形式就称作该思维的逻辑形式，又称为形式结构，简称公式
其中保持不变的是逻辑常量，变化的是逻辑变量。
</p>
</div>
<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> 第一组 （命题）所有S是P</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>所有商品都是有价值的。
</li>
<li>所有物质都是可分割的。
</li>
<li>所有发展都是由事物内部矛盾引起的。
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> 第二组 （命题）如果p,那么q</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>如果为人民利益而死，就比泰山还重。
</li>
<li>如果一个人得了肺病，那么这个人就会发烧。
</li>
<li>如果出现了阶级，那么就会出现国家。
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> 第三组 （推理，因果关系）所有M都是P;所有S都是M</h4>
<div class="outline-text-4" id="text-3-1-3">
<ul class="org-ul">
<li>所有学生都应该知书识礼。            所有M都是P
</li>
<li>所有大学生都是学生。                所有S都是M
</li>
<li>-&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014; 
</li>
<li>所以，所以大学生都应该知书识礼。    所以，所有S都是P
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 常用逻辑符号</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> 逻辑常项</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
定义：指的是一个逻辑形式中具有确切含义，其含义始终保持不变得部分
如下：“ <b>如果</b>&#x2026;&#x2026; <b>那么</b> &#x2026;&#x2026;"
</p>
</div>
</div>
<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> 逻辑变项</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
定义：指一个逻辑形式中没有确切含义，可用不同词项或者命题进行替换的部分。
如下：S,P等等。
</p>
</div>
</div>
<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> 词项变项</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
通常用 <span class="underline">大写字母</span> ：S,P,M表示。
</p>
</div>
</div>
<div id="outline-container-sec-3-2-4" class="outline-4">
<h4 id="sec-3-2-4"><span class="section-number-4">3.2.4</span> 命题变项</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
一般使用 <span class="underline">小写字母</span> 表示：p，q，r，s。
</p>
</div>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. 逻辑学介绍</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. 事实错误与逻辑错误</a></li>
<li><a href="#sec-1-2">1.2. 例题</a></li>
<li><a href="#sec-1-3">1.3. 三段论逻辑</a></li>
<li><a href="#sec-1-4">1.4. 选择观察效应</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 引言:大师与智者</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. 半费之讼</a></li>
<li><a href="#sec-2-2">2.2. 苏格拉底</a></li>
<li><a href="#sec-2-3">2.3. “逻辑学之父”:亚里士多德</a></li>
<li><a href="#sec-2-4">2.4. 公孙龙</a></li>
<li><a href="#sec-2-5">2.5. 邓析</a></li>
<li><a href="#sec-2-6">2.6. 名学辩学大成:墨子</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 思维形态与语言单位</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. 思维形式</a></li>
<li><a href="#sec-3-2">3.2. 常用逻辑符号</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="date">Created: 2019-09-06 周五 00:08</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.2 (<a href="http://orgmode.org">Org-mode</a> 9.1.9)</p>
</div>
</footer>
</body>
</html>
